*** Settings ***

Documentation  A test suite with a tests for simple tender auction.
Suite setup       Підготовка тесту
Suite teardown    Close all browsers
Resource       resource.robot

*** Variables ***
${round1_bidder1}  id=stage-1
${round1_bidder2}  id=stage-2
${round2_bidder1}  id=stage-4
${round2_bidder2}  id=stage-5
${round3_bidder1}  id=stage-7
${round3_bidder2}  id=stage-8

*** Test Cases ***
Перевірка логіну
    Залогуватись користувачами

Очікування 1-ого раунду
    Дочекатись паузи перед 1 раундом
    Перевірити інформацію про тендер
    Дочекатись завершення паузи перед 1 раундом

1-ий раунд
    Вибрати кориcтувача, який може поставити ставку
    Спробувати вказати невалідну тривалість дії контракту
    Спробувати вказати невалідний відсоток щорічних платежів
    Поставити мінімально допустиму ставку  8  220  90
    Run Keyword And Ignore Error  Відмінитити ставку
    Дочекатись учасником закінчення стадії ставок
    Перевірити чи ставка була прийнята  ${round1_bidder1}
    Вибрати кориcтувача, який може поставити ставку
    Поставити мінімально допустиму ставку  8  220  90
    Дочекатись учасником закінчення стадії ставок
    Перевірити чи ставка була прийнята  ${round1_bidder2}

Очікування 2-ого раунду
    Дочекатись паузи перед 2 раундом
    Дочекатись завершення паузи перед 2 раундом

2-ий раунд
    Вибрати кориcтувача, який може поставити ставку
    Поставити мінімально допустиму ставку  8  220  85
    Дочекатись учасником закінчення стадії ставок
    Перевірити чи ставка була прийнята  ${round2_bidder1}
    Вибрати кориcтувача, який може поставити ставку
    Поставити мінімально допустиму ставку  8  220  85
    Дочекатись учасником закінчення стадії ставок
    Перевірити чи ставка була прийнята  ${round2_bidder2}

Очікування 3-ого раунду
    Дочекатись паузи перед 3 раундом
    Дочекатись завершення паузи перед 3 раундом

3-ий раунд
    Вибрати кориcтувача, який може поставити ставку
    Поставити мінімально допустиму ставку  7  220  80
    Дочекатись учасником закінчення стадії ставок
    Перевірити чи ставка була прийнята  ${round3_bidder1}
    Вибрати кориcтувача, який може поставити ставку
    Поставити мінімально допустиму ставку  7  220  80
    Дочекатись учасником закінчення стадії ставок
    Перевірити чи ставка була прийнята  ${round3_bidder2}

Завершення аукціону
    Дочекатись до завершення аукціону  15 min
